//A:6个月内(%)
//B:6个月至1年(%)
//C:一年至三年(%)
//D:三年至五年(%)
//E:五年以上(%) 
var LiLvType = [
{ "min": "2015-10-24", "max": "0", "A": "4.35", "B": "4.35", "C": "4.75", "D": "4.75", "E": "4.90" },
{ "min": "2015-08-26", "max": "2015-10-23", "A": "4.60", "B": "4.60", "C": "5.00", "D": "5.00", "E": "5.15" },
{ "min": "2015-06-28", "max": "2015-08-25", "A": "4.85", "B": "4.85", "C": "5.25", "D": "5.25", "E": "5.40" },
{ "min": "2015-05-11", "max": "2015-06-27", "A": "5.10", "B": "5.10", "C": "5.50", "D": "5.50", "E": "5.65" },
{ "min": "2015-03-01", "max": "2015-05-10", "A": "5.35", "B": "5.35", "C": "5.75", "D": "5.75", "E": "5.90" },
{ "min": "2014-11-22", "max": "2015-02-28", "A": "5.60", "B": "5.60", "C": "6.00", "D": "6.00", "E": "6.15" },
{ "min": "2012-07-06", "max": "2014-11-21", "A": "5.60", "B": "6.00", "C": "6.15", "D": "6.40", "E": "6.55" },
{ "min": "2012-06-08", "max": "2012-07-05", "A": "5.85", "B": "6.31", "C": "6.40", "D": "6.65", "E": "6.80" },
{ "min": "2011-07-07", "max": "2012-06-07", "A": "6.10", "B": "6.56", "C": "6.65", "D": "6.90", "E": "7.05" },
{ "min": "2011-04-06", "max": "2011-07-06", "A": "5.85", "B": "6.31", "C": "6.40", "D": "6.65", "E": "6.80" },
{ "min": "2011-02-09", "max": "2011-04-05", "A": "5.60", "B": "6.06", "C": "6.10", "D": "6.45", "E": "6.60" },
{ "min": "2010-12-26", "max": "2011-02-08", "A": "5.35", "B": "5.81", "C": "5.85", "D": "6.22", "E": "6.40" },
{ "min": "2010-10-20", "max": "2010-12-25", "A": "5.10", "B": "5.56", "C": "5.60", "D": "5.96", "E": "6.14" },
{ "min": "2008-12-23", "max": "2010-10-19", "A": "4.86", "B": "5.31", "C": "5.40", "D": "5.76", "E": "5.94" },
{ "min": "2008-11-27", "max": "2008-12-22", "A": "5.04", "B": "5.58", "C": "5.67", "D": "5.94", "E": "6.12" },
{ "min": "2008-10-30", "max": "2008-11-26", "A": "6.03", "B": "6.66", "C": "6.75", "D": "7.02", "E": "7.20" },
{ "min": "2008-10-27", "max": "2008-10-29", "A": "6.12", "B": "6.93", "C": "7.02", "D": "7.29", "E": "7.47" },
{ "min": "2008-10-09", "max": "2008-10-26", "A": "6.12", "B": "6.93", "C": "7.02", "D": "7.29", "E": "7.47" },
{ "min": "2008-09-16", "max": "2008-10-08", "A": "6.21", "B": "7.20", "C": "7.29", "D": "7.56", "E": "7.74" },
{ "min": "2007-12-21", "max": "2008-09-15", "A": "6.57", "B": "7.47", "C": "7.56", "D": "7.74", "E": "7.83" },
{ "min": "2007-09-15", "max": "2007-12-20", "A": "6.48", "B": "7.29", "C": "7.47", "D": "7.65", "E": "7.83" },
{ "min": "2007-08-22", "max": "2007-09-14", "A": "6.21", "B": "7.02", "C": "7.20", "D": "7.38", "E": "7.56" },
{ "min": "2007-07-21", "max": "2007-08-21", "A": "6.03", "B": "6.84", "C": "7.02", "D": "7.20", "E": "7.38" },
{ "min": "2007-05-19", "max": "2007-07-20", "A": "5.85", "B": "6.57", "C": "6.75", "D": "6.93", "E": "7.20" },
{ "min": "2007-03-18", "max": "2007-05-18", "A": "5.67", "B": "6.39", "C": "6.57", "D": "6.75", "E": "7.11" },
{ "min": "2006-08-19", "max": "2007-03-17", "A": "5.58", "B": "6.12", "C": "6.30", "D": "6.48", "E": "6.84" },
{ "min": "2006-04-28", "max": "2006-08-18", "A": "5.40", "B": "5.85", "C": "6.03", "D": "6.12", "E": "6.39" },
{ "min": "2005-03-17", "max": "2006-04-27", "A": "5.22", "B": "5.58", "C": "5.76", "D": "5.85", "E": "6.12" },
{ "min": "2004-10-29", "max": "2005-03-16", "A": "5.22", "B": "5.58", "C": "5.76", "D": "5.85", "E": "6.12" },
{ "min": "2002-02-21", "max": "2004-10-28", "A": "5.04", "B": "5.31", "C": "5.49", "D": "5.58", "E": "5.76" },
{ "min": "1999-06-10", "max": "2002-02-20", "A": "5.58", "B": "5.85", "C": "5.94", "D": "6.03", "E": "6.21" },
{ "min": "1998-12-07", "max": "1999-06-09", "A": "6.12", "B": "6.39", "C": "6.66", "D": "7.20", "E": "7.56" },
{ "min": "1998-07-01", "max": "1998-12-06", "A": "6.57", "B": "6.93", "C": "7.11", "D": "7.65", "E": "8.01" },
{ "min": "1998-03-25", "max": "1998-06-30", "A": "7.02", "B": "7.92", "C": "9.00", "D": "9.72", "E": "10.35" },
{ "min": "1997-10-23", "max": "1998-03-24", "A": "7.65", "B": "8.64", "C": "9.36", "D": "9.90", "E": "10.53" },
{ "min": "1996-08-23", "max": "1997-10-22", "A": "9.18", "B": "10.08", "C": "10.98", "D": "11.70", "E": "12.42" },
{ "min": "1996-05-01", "max": "1996-08-22", "A": "9.72", "B": "10.98", "C": "13.14", "D": "14.94", "E": "15.12" },
{ "min": "1995-07-01", "max": "1996-04-30", "A": "10.08", "B": "12.06", "C": "13.50", "D": "15.12", "E": "15.30" },
{ "min": "1995-01-01", "max": "1995-06-30", "A": "9.00", "B": "10.98", "C": "12.96", "D": "14.58", "E": "14.76" },
{ "min": "1993-07-11", "max": "1994-12-31", "A": "9.00", "B": "10.98", "C": "12.24", "D": "13.86", "E": "14.04" },
{ "min": "1993-05-15", "max": "1993-07-10", "A": "8.82", "B": "9.36", "C": "10.80", "D": "12.06", "E": "12.24" },
{ "min": "1991-04-21", "max": "1993-05-14", "A": "8.10", "B": "8.64", "C": "9.00", "D": "9.54", "E": "9.72" },
{ "min": "1991-03-21", "max": "1991-04-20", "A": "9.00", "B": "10.08", "C": "10.80", "D": "11.52", "E": "11.88" },
{ "min": "1990-08-21", "max": "1991-03-20", "A": "8.64", "B": "9.36", "C": "10.08", "D": "10.80", "E": "11.16" },
{ "min": "1989-02-01", "max": "1990-08-20", "A": "11.34", "B": "11.34", "C": "12.78", "D": "14.40", "E": "19.26" }
];

//计算公式：prices*年利率/360）*贷款天数
function setMoney() {
    if (PostCheck()) {
        var sdata = $("#d1").val();//开始日期
        var edate = $("#d2").val();//结束日期
        var prices = parseFloat($("#prices").val());//金额
        var type = $("#type").val();//类型
        var value = "";
        //var sdata = "2015-08-29";; //开始日期
        //var edate = "2015-11-29"; //结束日期
        //var prices = parseFloat("10000"); //金额
       // var type = "A"; //类型
        $.each(LiLvType, function(i) {
            var min = LiLvType[i]["min"]; //日期间隔 区间最小
            var max = LiLvType[i]["max"]; //日期间隔 区间最大
            var lv = parseFloat(LiLvType[i][type]) / 100;
            var mindate = new Date(min.replace(/\-/g, "\/"));
            var begin = new Date(sdata.replace(/\-/g, "\/"));
            var end = new Date(edate.replace(/\-/g, "\/"));
            var daytime = 24 * 60 * 60 * 1000; //一天的毫秒总数
            var days = 0;
            var endPrice = 0;
            var maxdate = new Date(max.replace(/\-/g, "\/"));

            if (max !== "0") {
                if (mindate <= begin && maxdate >= end) { //开始时间和结束时间都在区间内
                    days = (end - begin) / daytime;
                    value += getTime(begin) + " 至 " + getTime(end) + " 共 " + days + "天";
                    endPrice = ((prices * lv) / 360) * days;
                    value += "<br />" + " 利率为：" + (lv * 100).toFixed(2) + "%，利息为：" + endPrice.toFixed(2) + "<br /><hr style='1px #999999 solid'/>";
                } else if (mindate <= begin && maxdate >= begin && maxdate <= end) { //开始时间在区间内  结束时间在区间外
                    days = (maxdate - begin) / daytime + 1;
                    value += getTime(mindate) + " 至 " + getTime(maxdate) + " 共 " + days + "天";
                    endPrice = ((prices * lv) / 360) * days;
                    value += "<br />" + " 利率为：" + (lv * 100).toFixed(2) + "%，利息为：" + endPrice.toFixed(2) + "<br /><hr style='1px #999999 solid'/>";
                } else if (begin <= mindate && maxdate >= end && mindate <= end) { //开始时间在区间内  结束时间在区间内
                    days = (end - mindate) / daytime;
                    endPrice = ((prices * lv) / 360) * days;
                    value += getTime(mindate) + " 至 " + getTime(end) + " 共 " + days + "天 ";
                    value += "<br />" + " 利率为：" + (lv * 100).toFixed(2) + "%，利息为：" + endPrice.toFixed(2) + "<br /><hr style='1px #999999 solid'/>";
                } else if ((begin <= mindate && end >= maxdate)) { //开始时间和结束时间都在区间外
                    days = (maxdate - mindate) / daytime + 1;
                    endPrice = ((prices * lv) / 360) * days;
                    value += getTime(mindate) + " 至 " + getTime(maxdate) + " 共 " + days + "天 ";
                    value += "<br />" + " 利率为：" + (lv * 100).toFixed(2) + "%，利息为：" + endPrice.toFixed(2) + "<br /><hr style='1px #999999 solid'/>";
                }

            } else if (mindate <= end && begin <= mindate && max === "0") { //最后一个阶段  开始时间小于区间最小值
                days = (end - mindate) / daytime;
                value += getTime(mindate) + " 至 " + getTime(end) + " 共 " + days + "天 ";
                endPrice = ((prices * lv) / 360) * days;
                value += "<br />" + " 利率为：" + (lv * 100).toFixed(2) + "%，利息为：" + endPrice.toFixed(2) + "<br /><hr style='1px #999999 solid'/>";
            } else if (mindate <= end && begin >= mindate && max === "0") { //最后一个阶段 开始时间大于区间最小值
                days = (end - begin) / daytime;
                value += getTime(begin) + " 至 " + getTime(end) + " 共 " + days + "天 ";
                endPrice = ((prices * lv) / 360) * days;
                value += "<br />" + " 利率为：" + (lv * 100).toFixed(2) + "%，利息为：" + endPrice.toFixed(2) + "<br /><hr style='1px #999999 solid'/>";
            }
          
            //alert(key);
            //alert(liLvType[key]);
            $("#table").show();
            $("#Price").html(value);
        });
    }
}

function getTime(time) {
    var mStrin = new String(time.getMonth() + 1);
    var dStrin = new String(time.getDate());
    if (mStrin.length === 1) {
        mStrin = "0" + mStrin;
    }
    if (dStrin.length === 1) {
        dStrin = "0" + dStrin;
    }
    var strinDate = time.getFullYear() + "-" + mStrin + "-" + dStrin;
    return strinDate;
}

