
//一次性伤残补助金(本人工资乘以*月份), //一次性工伤医疗补助金(统筹地区上年度职工月平均工资 * 月份),
//一次性伤残就业补助金(统筹地区上年度职工月平均工资 * 月份),按月享受伤残津贴(本人工资*百分比)


//省名称，代号，说明跳转地址，上年度月平均工资，最低工资标准，一次性医疗和就业不租金是否需要分开 
//0 需要  1 不需要,部分不能自理的护理费计算比例,大部分不能自理的护理费计算比例,完全不能自理的护理费计算比例,
var ajType = [
    { "name": "浙江", "value": "A1", "Url": "zjgs.html", "prices": "5092", "czprices": "51261", "minPrice": "2010", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "上海", "value": "A4", "Url": "shgs.html", "prices": "7132", "czprices": "62596", "minPrice": "2420", "Spilt": "1", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "北京", "value": "A5", "Url": "bjgs.html", "prices": "8467", "czprices": "62406", "minPrice": "2420", "Spilt": "1", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "安徽", "value": "A2", "Url": "ahgs.html", "prices": "5661", "czprices": "31640", "minPrice": "1520", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "广东", "value": "A3", "Url": "gdgs.html", "prices": "6668", "czprices": "40975", "minPrice": "2100", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "福建", "value": "A6", "Url": "fjgs.html", "prices": "5752", "czprices": "39001", "minPrice": "1700", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "河南", "value": "A7", "Url": "hngs.html", "prices": "4666", "czprices": "29558", "minPrice": "1720", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "河北", "value": "A8", "Url": "hbgs.html", "prices": "5439", "czprices": "30548", "minPrice": "1650", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "江苏", "value": "A9", "Url": "jsgs.html", "prices": "6522", "czprices": "43622", "minPrice": "1890", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "甘肃", "value": "A10", "Url": "gsgs.html", "prices": "5477", "czprices": "27763", "minPrice": "1620", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "广西", "value": "A11", "Url": "gxgs.html", "prices": "5538", "czprices": "30502", "minPrice": "1680", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "贵州", "value": "A12", "Url": "gzgs.html", "prices": "5379", "czprices": "29080", "minPrice": "1680", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "湖南", "value": "A15", "Url": "hungs.html", "prices": "5500", "czprices": "33948", "minPrice": "1580", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "湖北", "value": "A14", "Url": "hubgs.html", "prices": "4659", "czprices": "31889", "minPrice": "1750", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "黑龙江", "value": "A13", "Url": "hljgs.html", "prices": "4672", "czprices": "27446", "minPrice": "1680", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "吉林", "value": "A16", "Url": "jlgs.html", "prices": "5121", "czprices": "28319", "minPrice": "1780", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "江西", "value": "A17", "Url": "jxgs.html", "prices": "5256", "czprices": "31198", "minPrice": "1680", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "辽宁", "value": "A18", "Url": "lngs.html", "prices": "5212", "czprices": "34993", "minPrice": "1530", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "内蒙古", "value": "A19", "Url": "nmggs.html", "prices": "5557", "czprices": "35670", "minPrice": "1760", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "宁夏", "value": "A20", "Url": "nxgs.html", "prices": "4867", "czprices": "29472", "minPrice": "1660", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "青海", "value": "A21", "Url": "qhgs.html", "prices": "6308", "czprices": "21473", "minPrice": "1500", "Spilt": "1", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "山东", "value": "A22", "Url": "sdgs.html", "prices": "5775", "czprices": "36789", "minPrice": "1910", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "山西", "value": "A23", "Url": "sxgs.html", "prices": "5129", "czprices": "29132", "minPrice": "1620", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "陕西", "value": "A24", "Url": "shanxgs.html", "prices": "5619", "czprices": "30810", "minPrice": "1680", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "四川", "value": "A25", "Url": "scgs.html", "prices": "4889", "czprices": "30727", "minPrice": "1780", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
    { "name": "天津", "value": "A26", "Url": "tjgs.html", "prices": "5607", "czprices": "37022", "minPrice": "2050", "Spilt": "1", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
     //{ "name": "西安", "value": "A27", "Url": "xa.html", "prices": "3709", "minPrice": "5939", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
  { "name": "西藏", "value": "A28", "Url": "xzgs.html", "prices": "6708", "czprices": "30671", "minPrice": "1650", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
{ "name": "新疆", "value": "A29", "Url": "xjgs.html", "prices": "5032", "czprices": "30775", "minPrice": "1820", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
//{ "name": "银川", "value": "A30", "Url": "yc.html", "prices": "3709", "minPrice": "5939", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
{ "name": "重庆", "value": "A32", "Url": "cqgs.html", "prices": "5616", "czprices": "32193", "minPrice": "1500", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
{ "name": "云南", "value": "A31", "Url": "yngs.html", "prices": "6126", "czprices": "30996", "minPrice": "1670", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
{ "name": "海南", "value": "A33", "Url": "hainan.html", "prices": "6324", "czprices": "33349", "minPrice": "1670", "Spilt": "0", "Bf": "0.3", "DBf": "0.4", "WQ": "0.5" },
];

//一次性伤残补助金,一次性工伤医疗补助金,一次性伤残就业补助金,按月享受伤残津贴(比例)
var moneyType = [
     {
         "name": "A33", //海南
         "value": [
             {
                 "0": "0,6,0.4,0.3",
                 "1": "27,0,0,0.9",
                 "2": "25,0,0,0.85",
                 "3": "23,0,0,0.8",
                 "4": "21,0,0,0.75",
                 "5": "18,18,40,0.7",
                 "6": "16,16,30,0.6",
                 "7": "13,14,20,0",
                 "8": "11,12,16,0",
                 "9": "9,10,12,0",
                 "10": "7,8,9,0"
             }
         ]
     },
    {
        "name": "A1",//浙江
        "value": [{
            "0": "0,6,0.4,0.3", "1": "27,0,0,0.9", "2": "25,0,0,0.8", "3": "23,0,0,0.85", "4": "21,0,0,0.75", "5": "18,30,30,0.7", "6": "16,25,25,0.6",
            "7": "13,10,10,0", "8": "11,7,7,0", "9": "9,4,4,0", "10": "7,2,2,0"
        }]
    }, {
        "name": "A4",//上海
        "value": [
        {
            "0": "0,6,0.4,0.3",
            "1": "27,0,0,0.9",
            "2": "25,0,0,0.85",
            "3": "23,0,0,0.8",
            "4": "21,0,0,0.75",
            "5": "18,30,30,0.7",
            "6": "16,25,25,0.6",
            "7": "13,20,20,0",
            "8": "11,15,15,0",
            "9": "9,10,10,0",
            "10": "7,5,5,0"
        }
        ]
    }, {
        "name": "A5",//北京
        "value": [
        {
            "0": "0,6,0.4,0.3",
            "1": "27,0,0,0.9",
            "2": "25,0,0,0.85",
            "3": "23,0,0,0.8",
            "4": "21,0,0,0.75",
            "5": "18,24,24,0.7",
            "6": "16,18,18,0.6",
            "7": "13,15,15,0",
            "8": "11,10,10,0",
            "9": "9,8,8,0",
            "10": "7,6,6,0"
        }
        ]
    }
    , {
        "name": "A2",//安徽
        "value": [
        {
            "0": "0,6,0.4,0.3",
            "1": "27,0,0,0.9",
            "2": "25,0,0,0.85",
            "3": "23,0,0,0.8",
            "4": "21,0,0,0.75",
            "5": "18,20,35,0.7",
            "6": "16,15,30,0.6",
            "7": "13,10,20,0",
            "8": "11,8,15,0",
            "9": "9,6,10,0",
            "10": "7,4,5,0"
        }
        ]
    }, {
        "name": "A3",//广东
        "value": [
        {
            "0": "0,6,0.4,0.3",
            "1": "27,0,0,0.9",
            "2": "25,0,0,0.85",
            "3": "23,0,0,0.8",
            "4": "21,0,0,0.75",
            "5": "18,10,50,0.7",
            "6": "16,8,40,0.6",
            "7": "13,6,25,0",
            "8": "11,4,15,0",
            "9": "9,2,8,0",
            "10": "7,1,4,0"
        }
        ]
    }, {
        "name": "A6",//福建
        "value": [
        {
            "0": "0,6,0.4,0.3",
            "1": "27,0,0,0.9",
            "2": "25,0,0,0.85",
            "3": "23,0,0,0.8",
            "4": "21,0,0,0.75",
            "5": "18,15,15,0.7",
            "6": "16,15,15,0.6",
            "7": "13,10,10,0",
            "8": "11,10,10,0",
            "9": "9,5,5,0",
            "10": "7,3,3,0"
        }
        ]
    }, {
        "name": "A7",//河南
        "value": [
        {
            "0": "0,6,0.4,0.3",
            "1": "27,0,0,0.9",
            "2": "25,0,0,0.85",
            "3": "23,0,0,0.8",
            "4": "21,0,0,0.75",
            "5": "18,16,56,0.7",
            "6": "16,14,46,0.6",
            "7": "13,12,36,0",
            "8": "11,10,26,0",
            "9": "9,8,16,0",
            "10": "7,6,6,0"
        }
        ]
    }, {
        "name": "A8", //河北
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,44,22,0.7",
                "6": "16,38,16,0.6",
                "7": "13,26,10,0",
                "8": "11,20,8,0",
                "9": "9,14,6,0",
                "10": "7,8,4,0"
            }
        ]
    }, {
        "name": "A9", //江苏
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,200000,95000,0.7",
                "6": "16,160000,85000,0.6",
                "7": "13,120000,45000,0",
                "8": "11,80000,35000,0",
                "9": "9,50000,25000,0",
                "10": "7,30000,15000,0"
            }
        ]
    }, {
        "name": "A10", //甘肃
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,40,12,0.7",
                "6": "16,34,11,0.6",
                "7": "13,28,10,0",
                "8": "11,22,9,0",
                "9": "9,16,8,0",
                "10": "7,10,7,0"
            }
        ]
    }, {
        "name": "A11", //广西
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,18,16,0.7",
                "6": "16,16,14,0.6",
                "7": "13,14,12,0",
                "8": "11,12,10,0",
                "9": "9,10,8,0",
                "10": "7,8,6,0"
            }
        ]
    }, {
        "name": "A12", //贵州
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,18,16,0.7",
                "6": "16,16,14,0.6",
                "7": "13,14,12,0",
                "8": "11,12,10,0",
                "9": "9,10,8,0",
                "10": "7,8,6,0"
            }
        ]
    }, {
        "name": "A15", //湖南
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,24,36,0.7",
                "6": "16,18,30,0.6",
                "7": "13,15,15,0",
                "8": "11,10,10,0",
                "9": "9,8,8,0",
                "10": "7,6,6,0"
            }
        ]
    }
    , {
        "name": "A14", //湖北 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,22,34,0.7",
                "6": "16,18,28,0.6",
                "7": "13,12,20,0",
                "8": "11,10,16,0",
                "9": "9,8,12,0",
                "10": "7,6,8,0"
            }
        ]
    }, {
        "name": "A13", //黑龙江 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,30,16,0.7",
                "6": "16,25,14,0.6",
                "7": "13,20,12,0",
                "8": "11,15,10,0",
                "9": "9,10,8,0",
                "10": "7,5,6,0"
            }
        ]
    }, {
        "name": "A16", //吉林 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,18,18,0.7",
                "6": "16,16,16,0.6",
                "7": "13,13,13,0",
                "8": "11,11,11,0",
                "9": "9,9,9,0",
                "10": "7,7,7,0"
            }
        ]
    }, {
        "name": "A17", //江西 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,20,32,0.7",
                "6": "16,17,28,0.6",
                "7": "13,13,25,0",
                "8": "11,10,21,0",
                "9": "9,7,17,0",
                "10": "7,4,13,0"
            }
        ]
    }, {
        "name": "A18", //辽宁 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,16,28,0.7",
                "6": "16,14,24,0.6",
                "7": "13,12,20,0",
                "8": "11,10,16,0",
                "9": "9,8,12,0",
                "10": "7,6,8,0"
            }
        ]
    }, {
        "name": "A19", //内蒙古 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,26,26,0.7",
                "6": "16,23,23,0.6",
                "7": "13,16,16,0",
                "8": "11,13,13,0",
                "9": "9,10,10,0",
                "10": "7,7,7,0"
            }
        ]
    }, {
        "name": "A20", //宁夏 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,35,35,0.9",
                "2": "25,32,32,0.85",
                "3": "23,29,29,0.8",
                "4": "21,26,26,0.75",
                "5": "18,22,22,0.7",
                "6": "16,19,19,0.6",
                "7": "13,15,15,0",
                "8": "11,12,12,0",
                "9": "9,9,9,0",
                "10": "7,6,6,0"
            }
        ]
    }, {
        "name": "A21", //青海 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,30,30,0.7",
                "6": "16,27,27,0.6",
                "7": "13,24,24,0",
                "8": "11,21,21,0",
                "9": "9,18,18,0",
                "10": "7,15,15,0"
            }
        ]
    }, {
        "name": "A22", //山东 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,22,36,0.7",
                "6": "16,18,30,0.6",
                "7": "13,13,20,0",
                "8": "11,10,16,0",
                "9": "9,7,12,0",
                "10": "7,4,8,0"
            }
        ]
    }, {
        "name": "A23", //山西 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,36,24,0.7",
                "6": "16,33,21,0.6",
                "7": "13,24,15,0",
                "8": "11,21,12,0",
                "9": "9,18,9,0",
                "10": "7,15,6,0"
            }
        ]
    }, {
        "name": "A24", //陕西 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,24,24,0.7",
                "6": "16,21,21,0.6",
                "7": "13,15,15,0",
                "8": "11,12,12,0",
                "9": "9,9,9,0",
                "10": "7,6,6,0"
            }
        ]
    }, {
        "name": "A25", //四川 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,0,0,0.7",
                "6": "16,0,0,0.6",
                "7": "13,10,26,0",
                "8": "11,8,18,0",
                "9": "9,6,10,0",
                "10": "7,4,6,0"
            }
        ]
    }, {
        "name": "A26", //天津 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,30,30,0.7",
                "6": "16,25,25,0.6",
                "7": "13,20,20,0",
                "8": "11,15,15,0",
                "9": "9,10,10,0",
                "10": "7,5,5,0"
            }
        ]
    }, {
        "name": "A27", //西安 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,30,30,0.7",
                "6": "16,25,25,0.6",
                "7": "13,20,20,0",
                "8": "11,15,15,0",
                "9": "9,10,10,0",
                "10": "7,5,5,0"
            }
        ]
    }, {
        "name": "A28", //西藏 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,23,25,0.7",
                "6": "16,19,21,0.6",
                "7": "13,14,16,0",
                "8": "11,12,13,0",
                "9": "9,9,11,0",
                "10": "7,5,7,0"
            }
        ]
    }, {
        "name": "A29", //新疆 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,11,27,0.7",
                "6": "16,10,24,0.6",
                "7": "13,9,21,0",
                "8": "11,8,18,0",
                "9": "9,7,15,0",
                "10": "7,6,12,0"
            }
        ]
    }, {
        "name": "A30", //重庆 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,12,60,0.7",
                "6": "16,10,48,0.6",
                "7": "13,8,15,0",
                "8": "11,6,12,0",
                "9": "9,4,9,0",
                "10": "7,2,6,0"
            }
        ]
    }, {
        "name": "A31", //云南 
        "value": [
            {
                "0": "0,6,0.4,0.3",
                "1": "27,0,0,0.9",
                "2": "25,0,0,0.85",
                "3": "23,0,0,0.8",
                "4": "21,0,0,0.75",
                "5": "18,15,33,0.7",
                "6": "16,13,29,0.6",
                "7": "13,8,22,0",
                "8": "11,6,18,0",
                "9": "9,3,13,0",
                "10": "7,2,7,0"
            }
        ]
    },
];
$(document).ready(function () {
    var values = "";
    $.each(ajType, function (idx, item) {
        values += " <option value=\"" + item.value + "\">" + item.name + "</option>";
    });
    $("#t2").append(values);
});
function setJS() {
    if (PostCheck()) {
        var type = $("#t1").val(); //伤残等级
        var city = $("#t2").val(); //省份
        var p1 = $("#prices").val(); //本人工资
        var value = "";
        var prices = 0;
        var czprices = 0;
        var minPrices = 0;
        var bf = 0;
        var dbf = 0;
        var wq = 0;
        var isSpilt = 0;
        var aValue = 0;
        var bValue = 0;
        var cValue = 0;
        var dValue = 0;

        $.each(ajType, function (idxc, itemc) {
            if (itemc.value === city) {
                prices = itemc.prices;
                minPrices = itemc.minPrice;
                czprices = itemc.czprices;

                bf = parseFloat(itemc.Bf);
                dbf = parseFloat(itemc.DBf);
                wq = parseFloat(itemc.WQ);
                isSpilt = itemc.Spilt;
            }
        });


        $.each(moneyType, function (idx, item) {
            if (item.name === city) {
                //如果直接嗝屁了  按工亡统一标准
                if (type === "0") {
                    bValue = parseFloat(prices) * 6;
                    aValue = parseFloat(czprices) * 20;
                    var v2 = parseFloat(p1) * 0.4;
                    var v3 = parseFloat(p1) * 0.3;
                    $(".scjt").show();
                    $("#bzjDiv").html("");
                    $("#scjtDiv").html("");
                    $("#hlfDiv").html("");

                    $("#scjt").html("丧葬补助金");
                    $("#bzj").html("工亡补助金");
                    $("#shhlf").html("亲属抚恤金");
                    $("#scjtDiv").append("<li>丧葬补助金<span style='color:red'>" + bValue + "元</span></li>");
                    $("#bzjDiv").append("<li>一次性工亡补助金<span style='color:red'>" + aValue + "元</span></li>");
                    $("#hlfDiv").append("<li>配偶<span style='color:red'>" + v2 + "元/天</span></li>" +
                                     "<li>其他亲属<span style='color:red'>" + v3 + "元/天</span></li>");
                    $("#table").show();
                    aValue = parseFloat(aValue);
                    bValue = parseFloat(bValue);

                } else {
                    $("#scjt").html("伤残津贴");
                    $("#bzj").html("补助金");
                    $("#shhlf").html("生活护理费");
                    $.each(item.value, function (i) {
                        var list = item.value[i];
                        for (var key in list) {
                            if (list.hasOwnProperty(key)) {
                                if (type === key) {
                                    var a = list[key].split(",")[0]; //一次性伤残补助金(月份)
                                    var b = list[key].split(",")[1]; //一次性工伤医疗补助金(月份)
                                    var c = list[key].split(",")[2]; //一次性伤残就业补助金(月份)
                                    var d = list[key].split(",")[3]; //按月享受伤残津贴(比例)
                                    $("#bzjDiv").html("");
                                    $("#scjtDiv").html("");
                                    $("#hlfDiv").html("");
                                    dValue = 0;
                                    aValue = 0;
                                    $("#table").show();
                                    if (type < 5 && city !== "A20") {
                                        $(".scjt").show();
                                        aValue = p1 * a; //一次性伤残补助金(月份)
                                        $("#bzjDiv").append("<li>一次性伤残补助金<span style='color:red'>" + aValue + "元</span></li>");
                                        dValue = p1 * d; //按月享受伤残津贴(比例)
                                        if (dValue < parseFloat(minPrices)) {
                                            dValue = minPrices;
                                        }
                                        $("#scjtDiv").append("<li>伤残津贴<span style='color:red'>" + parseFloat(dValue).toFixed(2) + "元</span></li>");
                                        aValue = parseFloat(aValue);
                                        bValue = parseFloat(bValue);
                                        cValue = parseFloat(cValue);
                                        dValue = parseFloat(dValue);
                                    } else if (type >= 5 || city === "A20") {
                                        if (city === "A21") {
                                            bValue = p1 * b; //一次性工伤医疗补助金(月份)
                                            cValue = p1 * c; //一次性伤残就业补助金(月份)
                                        } else {
                                            bValue = prices * b; //一次性工伤医疗补助金(月份)
                                            cValue = prices * c; //一次性伤残就业补助金(月份)
                                        }
                                        $(".scjt").show();
                                        aValue = p1 * a; //一次性伤残补助金(月份)
                                        dValue = p1 * d; //按月享受伤残津贴(比例)
                                        if (dValue < parseFloat(minPrices)) {
                                            dValue = minPrices;
                                        }
                                        if (city === "A9") {
                                            bValue = parseFloat(b);
                                            cValue = parseFloat(c);
                                        }
                                        aValue = parseFloat(aValue);
                                        bValue = parseFloat(bValue);
                                        cValue = parseFloat(cValue);
                                        dValue = parseFloat(dValue);
                                        if (isSpilt === "1") {
                                            $("#scjtDiv").append("<li>伤残津贴<span style='color:red'>" + dValue.toFixed(2) + "元</span></li>");
                                            $("#bzjDiv").append("<li>一次性伤残补助金<span style='color:red'>" + aValue.toFixed(2) + "元</span></li>");
                                            if (bValue > 0) {
                                                $("#bzjDiv").append("<li>一次性工伤医疗补助金+一次性伤残就业补助金<span style='color:red'>" + bValue.toFixed(2) + "元</span></li>");
                                            }
                                            cValue = 0.00;
                                        } else {
                                            $("#scjtDiv").append("<li>伤残津贴<span style='color:red'>" + dValue.toFixed(2) + "元</span></li>");
                                            $("#bzjDiv").append("<li>一次性伤残补助金<span style='color:red'>" + aValue.toFixed(2) + "元</span></li>");
                                            if (bValue > 0) {
                                                $("#bzjDiv").append("<li>一次性工伤医疗补助金<span style='color:red'>" + bValue.toFixed(2) + "元</span></li>");
                                            }
                                            if (cValue > 0) {
                                                $("#bzjDiv").append("<li>一次性伤残就业补助金<span style='color:red'>" + cValue.toFixed(2) + "元</span></li>");
                                            }
                                        }
                                        if (type > 6) {
                                            $(".scjt").hide();
                                            dValue = 0.00;
                                        }
                                    }
                                    $("#hlfDiv").append("<li>部分不能自理<span style='color:red'>" + (prices * bf).toFixed(2) + "元/月</span></li>" +
                                            "<li>大部分不能自理<span style='color:red'>" + (prices * dbf).toFixed(2) + "元/月</span></li>" +
                                            "<li>完全不能自理<span style='color:red'>" + (prices * wq).toFixed(2) + "元/月</span></li>");
                                }
                            }
                        }

                    });
                }
                $("#pzjPrices").html((aValue + bValue + cValue + dValue));
                $.each(ajType, function (idx, item) {
                    if (item.value === city) {
                        $("#bzDiv").html("注：依据<a target='_balnk' href=\"elvshitools://html/gs/" + item.Url + "\">《" + item.name + "工伤赔偿标准》</a>文件计算，结果仅供参考");
                    }
                });


            }
        });




    }
}

