var ajType = [
    { "name": "浙江", "value": "A1", "Url": "zj.html" },
    { "name": "安徽", "value": "A2", "Url": "ah.html" },
    { "name": "上海", "value": "A4", "Url": "sh.html" },
    { "name": "北京", "value": "A5", "Url": "bj.html" },
    { "name": "广东", "value": "A3", "Url": "gd.html" },
    { "name": "福建", "value": "A6", "Url": "fj.html" },
    { "name": "河南", "value": "A7", "Url": "hen.html" },
    { "name": "河北", "value": "A8", "Url": "hb.html" },
    { "name": "江苏", "value": "A9", "Url": "js.html" },
    { "name": "甘肃", "value": "A10", "Url": "gs.html" },
    { "name": "广西", "value": "A11", "Url": "gx.html" },
    { "name": "贵州", "value": "A12", "Url": "gz.html" },
    { "name": "湖南", "value": "A15", "Url": "hun.html" },
    { "name": "湖北", "value": "A14", "Url": "hub.html" },
    { "name": "黑龙江", "value": "A13", "Url": "hlj.html" },
    { "name": "吉林", "value": "A16", "Url": "jl.html" },
    { "name": "江西", "value": "A17", "Url": "jx.html" },
    { "name": "辽宁", "value": "A18", "Url": "ln.html" },
    { "name": "内蒙古", "value": "A19", "Url": "nmg.html" },
    { "name": "宁夏", "value": "A20", "Url": "nx.html" },
    { "name": "青海", "value": "A21", "Url": "qh.html" },
    { "name": "山东", "value": "A22", "Url": "sd.html" },
    { "name": "山西", "value": "A23", "Url": "sx.html" },
    { "name": "陕西", "value": "A24", "Url": "shanx.html" },
     { "name": "四川", "value": "A25", "Url": "sc.html" },
     { "name": "天津", "value": "A26", "Url": "tj.html" },
     { "name": "西安", "value": "A27", "Url": "xa.html" },
     { "name": "西藏", "value": "A28", "Url": "xz.html" },
    { "name": "新疆", "value": "A29", "Url": "xj.html" },
    { "name": "银川", "value": "A30", "Url": "yc.html" },
    { "name": "重庆", "value": "A32", "Url": "cq.html" },
    { "name": "云南", "value": "A31", "Url": "yn.html" },
    { "name": "海南", "value": "A33", "Url": "hn.html" }


];
var xs = [
    {
        "name": "A1",//浙江
        "value": [
        {
            "T1": "1500-8000元", //侦查阶段
            "T2": "1500-10000元", //审查起诉阶段
            "T3": "2500-25000元" //审判阶段
        }
        ]
    }, {
        "name": "A2",//安徽
        "value": [
        {
            "T1": "1200-8000元", //侦查阶段
            "T2": "1200-8000元", //审查起诉阶段
            "T3": "1200-15000元" //审判阶段
        }
        ]
    }
    , {
        "name": "A3",//广东
        "value": [
        {
            "T1": "2000-6000元", //侦查阶段
            "T2": "6000-16000元", //审查起诉阶段
            "T3": "6000-33000元" //审判阶段
        }
        ]
    }
      , {
          "name": "A4",//上海
          "value": [
          {
              "T1": "1500-10000元", //侦查阶段
              "T2": "2000-10000元", //审查起诉阶段
              "T3": "3000-30000元" //审判阶段
          }
          ]
      }
         , {
             "name": "A5",//北京
             "value": [
             {
                 "T1": "2000—15000元", //侦查阶段
                 "T2": "2000—15000元", //审查起诉阶段
                 "T3": "4000—45000元" //审判阶段
             }
             ]
         }
          , {
              "name": "A6",//福建
              "value": [
              {
                  "T1": "1000—5000元", //侦查阶段
                  "T2": "1000—6000元", //审查起诉阶段
                  "T3": "1500—12000元" //审判阶段
              }
              ]
          }, {
              "name": "A7",//河南
              "value": [
              {
                  "T1": "3000—15000元", //侦查阶段
                  "T2": "5000—20000元", //审查起诉阶段
                  "T3": "5000—30000元" //审判阶段
              }
              ]
          }, {
              "name": "A8",//河北
              "value": [
              {
                  "T1": "2000—6000元", //侦查阶段
                  "T2": "3000—9000元", //审查起诉阶段
                  "T3": "4000—12000元" //审判阶段
              }
              ]
          }, {
              "name": "A9",//江苏
              "value": [
              {
                  "T1": "1000-8000元", //侦查阶段
                  "T2": "1500-10000元", //审查起诉阶段
                  "T3": "3000-20000元" //审判阶段
              }
              ]
          }, {
              "name": "A10",//甘肃
              "value": [
              {
                  "T1": "800-3000元", //侦查阶段
                  "T2": "800-5000元", //审查起诉阶段
                  "T3": "1000-5000元" //审判阶段
              }
              ]
          }, {
              "name": "A11",//广西
              "value": [
              {
                  "T1": "2000-15000元", //侦查阶段
                  "T2": "2000-15000元", //审查起诉阶段
                  "T3": "2000-150000元" //审判阶段
              }
              ]
          }
          , {
              "name": "A12",//贵州
              "value": [
              {
                  "T1": "30-3000", //侦查阶段
                  "T2": "500-5000", //审查起诉阶段
                  "T3": "500-5000元" //审判阶段
              }
              ]
          }, {
              "name": "A13",//黑龙江
              "value": [
              {
                  "T1": "1500元", //侦查阶段
                  "T2": "2000元", //审查起诉阶段
                  "T3": "3000元" //审判阶段
              }
              ]
          }, {
              "name": "A14",//湖北
              "value": [
              {
                  "T1": "1000-10000元", //侦查阶段
                  "T2": "1000-10000元", //审查起诉阶段
                  "T3": "1500-15000元" //审判阶段
              }
              ]
          }, {
              "name": "A15",//湖南
              "value": [
              {
                  "T1": "双方协商", //侦查阶段
                  "T2": "双方协商", //审查起诉阶段
                  "T3": "双方协商" //审判阶段
              }
              ]
          }

          , {
              "name": "A16",//吉林
              "value": [
              {
                  "T1": "2000元", //侦查阶段
                  "T2": "3000元", //审查起诉阶段
                  "T3": "5000元" //审判阶段
              }
              ]
          }
           , {
               "name": "A17",//江西
               "value": [
               {
                   "T1": "800-5000元", //侦查阶段
                   "T2": "800-5000元", //审查起诉阶段
                   "T3": "1600-15000元" //审判阶段
               }
               ]
           }, {
               "name": "A18",//辽宁
               "value": [
               {
                   "T1": "8000元", //侦查阶段
                   "T2": "8000元", //审查起诉阶段
                   "T3": "8000元" //审判阶段
               }
               ]
           }, {
               "name": "A19",//内蒙古
               "value": [
               {
                   "T1": "1000—5000元", //侦查阶段
                   "T2": "500—5000元", //审查起诉阶段
                   "T3": "1000—20000元" //审判阶段
               }
               ]
           }, {
               "name": "A20",//宁夏
               "value": [
               {
                   "T1": "1000-3000元", //侦查阶段
                   "T2": "1000-4000元", //审查起诉阶段
                   "T3": "2000-6000元" //审判阶段
               }
               ]
           }
           , {
               "name": "A21",//青海
               "value": [
               {
                   "T1": "300-1000元", //侦查阶段
                   "T2": "800-2000元", //审查起诉阶段
                   "T3": "1000-6000元" //审判阶段
               }
               ]
           }, {
               "name": "A22",//山东
               "value": [
               {
                   "T1": "500-10000元", //侦查阶段
                   "T2": "1500-12000元", //审查起诉阶段
                   "T3": "25000-20000元" //审判阶段
               }
               ]
           },
            {
                "name": "A23",//山西
                "value": [
                {
                    "T1": "2000-20000元", //侦查阶段
                    "T2": "2000-20000元", //审查起诉阶段
                    "T3": "3500-35000元" //审判阶段
                }
                ]
            },
            {
                "name": "A24",//陕西
                "value": [
                {
                    "T1": "500-5000元", //侦查阶段
                    "T2": "1000-5000元", //审查起诉阶段
                    "T3": "1000-10000元" //审判阶段
                }
                ]
            },
            {
                "name": "A25",//四川
                "value": [
                {
                    "T1": "2000-15000元", //侦查阶段
                    "T2": "2000-12000元", //审查起诉阶段
                    "T3": "3000-30000元" //审判阶段
                }
                ]
            },
            {
                "name": "A26",//天津
                "value": [
                {
                    "T1": "5000-10000元", //侦查阶段
                    "T2": "5000-10000元", //审查起诉阶段
                    "T3": "5000-30000元" //审判阶段
                }
                ]
            },
            {
                "name": "A27",//西安
                "value": [
                {
                    "T1": "双方协商", //侦查阶段
                    "T2": "双方协商", //审查起诉阶段
                    "T3": "双方协商" //审判阶段
                }
                ]
            },
            {
                "name": "A28",//西藏
                "value": [
                {
                    "T1": "1000-3000元", //侦查阶段
                    "T2": "2000-4000元", //审查起诉阶段
                    "T3": "3000-10000元" //审判阶段
                }
                ]
            },
            {
                "name": "A29",//新疆
                "value": [
                {
                    "T1": "500—2000元", //侦查阶段
                    "T2": "1000—4000元", //审查起诉阶段
                    "T3": "1500—5000元" //审判阶段
                }
                ]
            },
            {
                "name": "A30",//银川
                "value": [
                {
                    "T1": "3000—30000元", //侦查阶段
                    "T2": "5000—50000元", //审查起诉阶段
                    "T3": "5000—500000元" //审判阶段
                }
                ]
            },
            {
                "name": "A31",//云南
                "value": [
                {
                    "T1": "3000元", //侦查阶段
                    "T2": "4000元", //审查起诉阶段
                    "T3": "20000元" //审判阶段
                }
                ]
            },
            {
                "name": "A32",//重庆
                "value": [
                {
                    "T1": "2000—8000元", //侦查阶段
                    "T2": "3000—10000元", //审查起诉阶段
                    "T3": "5000—30000元" //审判阶段
                }
                ]
            },
            {
                "name": "A33",//海南
                "value": [
                {
                    "T1": "2000-20000元", //侦查阶段
                    "T2": "3000-30000元", //审查起诉阶段
                    "T3": "基层法院 2000元-20000元/件,中级以上 5000元-50000元/件" //审判阶段
                }
                ]
            }

];


//区间对应的比率和固定额
var endPrices = [
{
    //计算公式为 律师费＝(标的额-区间最小值)×计算比率＋上阶段区间律师费
    "name": "A1",//浙江
    "min": "2500",
    "max": "9999999999999",
    "value": [
        {
            "Min": "0", //标的额区间 区间最小值
            "Max": "100000", //标的额区间 区间最大值
            "BL": "0.06", //最小值计算比例
            "BL1": "0.08", //最大值计算比例
            "IsJs": "1", //是否需要计算
            "Number": "0", //固定额度
            "Number2": "0" //固定额度2(适用于区间费用)
        },
        {
            "Min": "100000", //标的额区间 区间最小值
            "Max": "500000", //标的额区间 区间最大值
            "IsJs": "1", //是否需要计算
            "BL": "0.05", //计算比例
            "BL1": "0.06", //计算比例
            "Number": "6000", //固定额度
            "Number2": "8000" //固定额度2
        }, {
            "Min": "500000", //标的额区间 区间最小值
            "Max": "1000000", //标的额区间 区间最大值
            "IsJs": "1", //是否需要计算
            "BL": "0.04", //计算比例
            "BL1": "0.05", //计算比例
            "Number": "26000", //固定额度
            "Number2": "32000" //固定额度2
        }, {
            "Min": "1000000", //标的额区间 区间最小值
            "Max": "5000000", //标的额区间 区间最大值
            "IsJs": "1", //是否需要计算
            "BL": "0.03", //计算比例
            "BL1": "0.04", //计算比例
            "Number": "46000", //固定额度
            "Number2": "57000" //固定额度2
        },
        {
            "Min": "5000000", //标的额区间 区间最小值
            "Max": "10000000", //标的额区间 区间最大值
            "IsJs": "1", //是否需要计算
            "BL": "0.02", //计算比例
            "BL1": "0.03", //计算比例
            "Number": "166000", //固定额度
            "Number2": "217000" //固定额度2
        },
        {
            "Min": "10000000", //标的额区间 区间最小值
            "Max": "9999999999999", //标的额区间 区间最大值
            "IsJs": "1", //是否需要计算
            "BL": "0.01", //计算比例
            "BL1": "0.02", //计算比例2
            "Number": "266000", //固定额度
            "Number2": "367000" //固定额度2
        }
    ]
}, {
    "name": "A2",//安徽
    "min": "1000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "8000" //固定额度2

    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.04", //计算比例
        "BL1": "0.06", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "8000" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.05", //计算比例2
         "Number": "17000", //固定额度
         "Number2": "32000" //固定额度2
     }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "32000", //固定额度
         "Number2": "57000" //固定额度2
     }
     , {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "112000", //固定额度
         "Number2": "217000" //固定额度2
     }
      , {
          "Min": "10000000", //标的额区间 区间最小值
          "Max": "9999999999999", //标的额区间 区间最大值
          "IsJs": "1", //是否需要计算
          "BL": "0.01", //计算比例
          "BL1": "0.02", //计算比例2
          "Number": "162000", //固定额度
          "Number2": "367000" //固定额度2
      }
    ]
}, {
    "name": "A3",//广东
    "min": "3000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "50000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "8000" //固定额度2

    }
    , {
        "Min": "50000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.08", //计算比例
        "BL1": "0.08", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "8000" //固定额度2
    }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "500000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.05", //计算比例
         "BL1": "0.05", //计算比例2
         "Number": "5000", //固定额度
         "Number2": "12000" //固定额度2
     }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "25000", //固定额度
         "Number2": "32000" //固定额度2
     }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "45000", //固定额度
         "Number2": "52000" //固定额度2
     }
      , {
          "Min": "5000000", //标的额区间 区间最小值
          "Max": "10000000", //标的额区间 区间最大值
          "IsJs": "1", //是否需要计算
          "BL": "0.02", //计算比例
          "BL1": "0.02", //计算比例2
          "Number": "165000", //固定额度
          "Number2": "172000" //固定额度2
      }
          , {
              "Min": "10000000", //标的额区间 区间最小值
              "Max": "50000000", //标的额区间 区间最大值
              "IsJs": "1", //是否需要计算
              "BL": "0.01", //计算比例
              "BL1": "0.01", //计算比例2
              "Number": "265000", //固定额度
              "Number2": "272000" //固定额度2
          }
          , {
              "Min": "50000000", //标的额区间 区间最小值
              "Max": "9999999999999", //标的额区间 区间最大值
              "IsJs": "1", //是否需要计算
              "BL": "0.005", //计算比例
              "BL1": "0.005", //计算比例2
              "Number": "665000", //固定额度
              "Number2": "672000" //固定额度2
          }
    ]
}, {
    "name": "A4",//上海
    "min": "3000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.08", //计算比例
        "BL1": "0.12", //计算比例2
        "Number": "0", //固定额度
        "Number2": "0" //固定额度2

    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "1000000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.05", //计算比例
        "BL1": "0.07", //计算比例2
        "Number": "8000", //固定额度
        "Number2": "12000" //固定额度2
    }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.05", //计算比例2
         "Number": "53000", //固定额度
         "Number2": "75000" //固定额度2
     }
     , {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "100000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "323000", //固定额度
         "Number2": "525000" //固定额度2
     }
      , {
          "Min": "100000000", //标的额区间 区间最小值
          "Max": "9999999999999", //标的额区间 区间最大值
          "IsJs": "1", //是否需要计算
          "BL": "0.005", //计算比例
          "BL1": "0.01", //计算比例2
          "Number": "1223000", //固定额度
          "Number2": "3225000" //固定额度2
      }
    ]
}, {
    "name": "A5",//北京
    "min": "2000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.5", //计算比例
        "BL1": "0", //计算比例2
        "Number": "0", //固定额度
        "Number2": "0" //固定额度2
    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.03", //计算比例
        "BL1": "0", //计算比例2
        "Number": "50000", //固定额度
        "Number2": "0" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.025", //计算比例
         "BL1": "0", //计算比例2
         "Number": "62000", //固定额度
         "Number2": "0" //固定额度2
     }
	 , {
	     "Min": "1000000", //标的额区间 区间最小值
	     "Max": "5000000", //标的额区间 区间最大值
	     "IsJs": "1", //是否需要计算
	     "BL": "0.02", //计算比例
	     "BL1": "0", //计算比例2
	     "Number": "74500", //固定额度
	     "Number2": "0" //固定额度2
	 }
	  , {
	      "Min": "5000000", //标的额区间 区间最小值
	      "Max": "10000000", //标的额区间 区间最大值
	      "IsJs": "1", //是否需要计算
	      "BL": "0.01", //计算比例
	      "BL1": "0", //计算比例2
	      "Number": "82500", //固定额度
	      "Number2": "0" //固定额度2
	  }
     , {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.0075", //计算比例
         "BL1": "0", //计算比例2
         "Number": "120000", //固定额度
         "Number2": "0" //固定额度2
     }
    ]
}
, {
    "name": "A6",//福建
    "min": "800",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "800", //固定额度
        "Number2": "6000" //固定额度2
    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.04", //计算比例
        "BL1": "0.04", //计算比例2
        "Number": "800", //固定额度
        "Number2": "6000" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "16800", //固定额度
         "Number2": "22000" //固定额度2
     }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "31800", //固定额度
         "Number2": "37000" //固定额度2
     }
      , {
          "Min": "5000000", //标的额区间 区间最小值
          "Max": "10000000", //标的额区间 区间最大值
          "IsJs": "1", //是否需要计算
          "BL": "0.012", //计算比例
          "BL1": "0.012", //计算比例2
          "Number": "111800", //固定额度
          "Number2": "117000" //固定额度2
      }
      , {
          "Min": "10000000", //标的额区间 区间最小值
          "Max": "50000000", //标的额区间 区间最大值
          "IsJs": "1", //是否需要计算
          "BL": "0.007", //计算比例
          "BL1": "0.007", //计算比例2
          "Number": "171800", //固定额度
          "Number2": "177000" //固定额度2
      }
       , {
           "Min": "50000000", //标的额区间 区间最小值
           "Max": "9999999999999", //标的额区间 区间最大值
           "IsJs": "1", //是否需要计算
           "BL": "0.0035", //计算比例
           "BL1": "0.0035", //计算比例2
           "Number": "451800", //固定额度
           "Number2": "457000" //固定额度2
       }
    ]
}, {
    "name": "A7",//河南
    "min": "2500",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "3000", //固定额度
        "Number2": "5000" //固定额度2
    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "1000000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.03", //计算比例
        "BL1": "0.05", //计算比例2
        "Number": "3000", //固定额度
        "Number2": "5000" //固定额度2
    }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "30000", //固定额度
         "Number2": "50000" //固定额度2
     }
     , {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "210000", //固定额度
         "Number2": "410000" //固定额度2
     }
      , {
          "Min": "50000000", //标的额区间 区间最小值
          "Max": "9999999999999", //标的额区间 区间最大值
          "IsJs": "1", //是否需要计算
          "BL": "0.005", //计算比例
          "BL1": "0.02", //计算比例2
          "Number": "610000", //固定额度
          "Number2": "1610000" //固定额度2
      }
    ]
}, {
    "name": "A8",//河北
    "min": "3000",
    "max": "9999999999999",
    "value": [
	  {
	      "Min": "0", //标的额区间 区间最小值
	      "Max": "10000", //标的额区间 区间最大值
	      "IsJs": "0", //是否需要计算
	      "BL": "0", //计算比例
	      "BL1": "0", //计算比例2
	      "Number": "3000", //固定额度
	      "Number2": "10000" //固定额度2
	  }
    , {
        "Min": "10000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.05", //计算比例
        "BL1": "0.06", //计算比例2
        "Number": "3000", //固定额度
        "Number2": "10000" //固定额度2
    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.05", //计算比例
        "BL1": "0.04", //计算比例2
        "Number": "7500", //固定额度
        "Number2": "15400" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "27500", //固定额度
         "Number2": "31400" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "47500", //固定额度
         "Number2": "46400" //固定额度2
     }
	 , {
	     "Min": "5000000", //标的额区间 区间最小值
	     "Max": "10000000", //标的额区间 区间最大值
	     "IsJs": "1", //是否需要计算
	     "BL": "0.02", //计算比例
	     "BL1": "0.01", //计算比例2
	     "Number": "167500", //固定额度
	     "Number2": "126400" //固定额度2
	 }
	 , {
	     "Min": "10000000", //标的额区间 区间最小值
	     "Max": "50000000", //标的额区间 区间最大值
	     "IsJs": "1", //是否需要计算
	     "BL": "0.01", //计算比例
	     "BL1": "0.005", //计算比例2
	     "Number": "267500", //固定额度
	     "Number2": "176400" //固定额度2
	 }
     , {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0", //计算比例2
         "Number": "667500", //固定额度
         "Number2": "376400" //固定额度2
     }
    ]
}, {
    "name": "A9",//江苏
    "min": "2500",
    "max": "9999999999999",
    "value": [
      {
        "Min": "0", //标的额区间 区间最小值
        "Max": "10000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "2500", //固定额度
        "Number2": "0" //固定额度2
    }
    , {
        "Min": "10000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.06", //计算比例
        "BL1": "0.07", //计算比例2
        "Number": "2500", //固定额度
        "Number2": "2500" //固定额度2
    }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "500000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.05", //计算比例
         "BL1": "0.06", //计算比例2
         "Number": "7900", //固定额度
         "Number2": "8800" //固定额度2
     }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0.05", //计算比例2
         "Number": "27900", //固定额度
         "Number2": "32800" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "47900", //固定额度
         "Number2": "57800" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "167900", //固定额度
         "Number2": "217800" //固定额度2
     }
     , {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "100000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "267900", //固定额度
         "Number2": "367800" //固定额度2
     }
     , {
         "Min": "100000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0.01", //计算比例2
         "Number": "1167900", //固定额度
         "Number2": "2167800" //固定额度2
     }
    ]
}, {
    "name": "A10",//甘肃
    "min": "5000",
    "max": "9999999999999",
    "value": [
     {
         "Min": "0", //标的额区间 区间最小值
         "Max": "100000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.08", //计算比例
         "BL1": "0.1", //计算比例2
         "Number": "0", //固定额度
         "Number2": "0" //固定额度2
     }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "500000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.07", //计算比例
         "BL1": "0.09", //计算比例2
         "Number": "8000", //固定额度
         "Number2": "10000" //固定额度2
     }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.06", //计算比例
         "BL1": "0.08", //计算比例2
         "Number": "36000", //固定额度
         "Number2": "46000" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.05", //计算比例
         "BL1": "0.07", //计算比例2
         "Number": "66000", //固定额度
         "Number2": "86000" //固定额度2
     }
	 , {
	     "Min": "5000000", //标的额区间 区间最小值
	     "Max": "10000000", //标的额区间 区间最大值
	     "IsJs": "1", //是否需要计算
	     "BL": "0.04", //计算比例
	     "BL1": "0.06", //计算比例2
	     "Number": "266000", //固定额度
	     "Number2": "366000" //固定额度2
	 }
	  , {
	      "Min": "10000000", //标的额区间 区间最小值
	      "Max": "50000000", //标的额区间 区间最大值
	      "IsJs": "1", //是否需要计算
	      "BL": "0.03", //计算比例
	      "BL1": "0.05", //计算比例2
	      "Number": "466000", //固定额度
	      "Number2": "666000" //固定额度2
	  }, {
	      "Min": "50000000", //标的额区间 区间最小值
	      "Max": "100000000", //标的额区间 区间最大值
	      "IsJs": "1", //是否需要计算
	      "BL": "0.02", //计算比例
	      "BL1": "0.04", //计算比例2
	      "Number": "1666000", //固定额度
	      "Number2": "2666000" //固定额度2
	  }
	 , {
	     "Min": "100000000", //标的额区间 区间最小值
	     "Max": "9999999999999", //标的额区间 区间最大值
	     "IsJs": "1", //是否需要计算
	     "BL": "0.01", //计算比例
	     "BL1": "0.02", //计算比例2
	     "Number": "2666000", //固定额度
	     "Number2": "4666000" //固定额度2
	 }
    ]
}, {
    "name": "A11",//广西
    "min": "1000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.05", //计算比例
        "BL1": "0", //计算比例2
        "Number": "0", //固定额度
        "Number2": "0" //固定额度2
    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.045", //计算比例
        "BL1": "0", //计算比例2
        "Number": "5000", //固定额度
        "Number2": "0" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0", //计算比例2
         "Number": "23000", //固定额度
         "Number2": "0" //固定额度2
     }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0", //计算比例2
         "Number": "43000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0", //计算比例2
         "Number": "163000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0", //计算比例2
         "Number": "263000", //固定额度
         "Number2": "0" //固定额度2
     }
    ]
}, {
    "name": "A12",//贵州
    "min": "6000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "10000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "6000", //固定额度
        "Number2": "0" //固定额度2
    }
    , {
        "Min": "10000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.07", //计算比例
        "BL1": "0", //计算比例2
        "Number": "6000", //固定额度
        "Number2": "0" //固定额度2
    }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "500000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.06", //计算比例
         "BL1": "0", //计算比例2
         "Number": "12300", //固定额度
         "Number2": "0" //固定额度2
     }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.05", //计算比例
         "BL1": "0", //计算比例2
         "Number": "36300", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0", //计算比例2
         "Number": "61300", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0", //计算比例2
         "Number": "221300", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "20000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0", //计算比例2
         "Number": "371300", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "20000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0", //计算比例2
         "Number": "571300", //固定额度
         "Number2": "0" //固定额度2
     }
    ]
}, {
    "name": "A13",//黑龙江
    "min": "800",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "20000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "800", //固定额度
        "Number2": "0" //固定额度2
    }
    , {
        "Min": "20000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.04", //计算比例
        "BL1": "0", //计算比例2
        "Number": "800", //固定额度
        "Number2": "0" //固定额度2
    }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "500000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0", //计算比例2
         "Number": "4000", //固定额度
         "Number2": "0" //固定额度2
     }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0", //计算比例2
         "Number": "16000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0", //计算比例2
         "Number": "26000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0", //计算比例2
         "Number": "66000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.0025", //计算比例
         "BL1": "0", //计算比例2
         "Number": "91000", //固定额度
         "Number2": "0" //固定额度2
     }
     , {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.0025", //计算比例
         "BL1": "0", //计算比例2
         "Number": "191000", //固定额度
         "Number2": "0" //固定额度2
     }
    ]
}
, {
    "name": "A14",//湖北
    "min": "600",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "600", //固定额度
        "Number2": "8000" //固定额度2
    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "1000000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.01", //计算比例
        "BL1": "0.05", //计算比例2
        "Number": "600", //固定额度
        "Number2": "8000" //固定额度2
    }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "9600", //固定额度
         "Number2": "53000" //固定额度2
     }
     , {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.003", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "29600", //固定额度
         "Number2": "173000" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.002", //计算比例
         "BL1": "0.015", //计算比例2
         "Number": "44600", //固定额度
         "Number2": "273000" //固定额度2
     }
     , {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.001", //计算比例
         "BL1": "0.01", //计算比例2
         "Number": "124600", //固定额度
         "Number2": "873000" //固定额度2
     }
    ]
}, {
    "name": "A15",//湖南
    "min": "3000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "3000", //固定额度
        "Number2": "10000" //固定额度2
    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.06", //计算比例
        "BL1": "0.08", //计算比例2
        "Number": "3000", //固定额度
        "Number2": "10000" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0.06", //计算比例2
         "Number": "27000", //固定额度
         "Number2": "42000" //固定额度2
     }
     , {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "20000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "207000", //固定额度
         "Number2": "312000" //固定额度2
     }, {
         "Min": "20000000", //标的额区间 区间最小值
         "Max": "100000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "507000", //固定额度
         "Number2": "912000" //固定额度2
     }
     , {
         "Min": "100000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0.01", //计算比例2
         "Number": "1307000", //固定额度
         "Number2": "2512000" //固定额度2
     }
    ]
}, {
    "name": "A16",//吉林
    "min": "5000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.08", //计算比例
        "BL1": "0.1", //计算比例2
        "Number": "8000", //固定额度
        "Number2": "10000" //固定额度2
    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.07", //计算比例
        "BL1": "0.09", //计算比例2
        "Number": "8000", //固定额度
        "Number2": "10000" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.06", //计算比例
         "BL1": "0.08", //计算比例2
         "Number": "36000", //固定额度
         "Number2": "46000" //固定额度2
     }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.05", //计算比例
         "BL1": "0.07", //计算比例2
         "Number": "66000", //固定额度
         "Number2": "86000" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0.06", //计算比例2
         "Number": "266000", //固定额度
         "Number2": "366000" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "20000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.05", //计算比例2
         "Number": "466000", //固定额度
         "Number2": "666000" //固定额度2
     }, {
         "Min": "20000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "766000", //固定额度
         "Number2": "1166000" //固定额度2
     }
     , {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "1366000", //固定额度
         "Number2": "2366000" //固定额度2
     }
    ]
}, {
    "name": "A17",//江西
    "min": "1000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "50000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "6000" //固定额度2
    }
    , {
        "Min": "50000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.015", //计算比例
        "BL1": "0.05", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "6000" //固定额度2
    }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.012", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "1750", //固定额度
         "Number2": "8500" //固定额度2
     }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "12550", //固定额度
         "Number2": "44500" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "52550", //固定额度
         "Number2": "164500" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.002", //计算比例
         "BL1": "0.015", //计算比例2
         "Number": "77550", //固定额度
         "Number2": "264500" //固定额度2
     }
     , {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.0011", //计算比例
         "BL1": "0.01", //计算比例2
         "Number": "157550", //固定额度
         "Number2": "864500" //固定额度2
     }
    ]
}, {
    "name": "A18",//辽宁
    "min": "5000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.08", //计算比例
        "BL1": "0.1", //计算比例2
        "Number": "0", //固定额度
        "Number2": "0" //固定额度2
    }
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.07", //计算比例
        "BL1": "0.09", //计算比例2
        "Number": "8000", //固定额度
        "Number2": "10000" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.06", //计算比例
         "BL1": "0.08", //计算比例2
         "Number": "36000", //固定额度
         "Number2": "46000" //固定额度2
     }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.05", //计算比例
         "BL1": "0.07", //计算比例2
         "Number": "66000", //固定额度
         "Number2": "86000" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0.06", //计算比例2
         "Number": "266000", //固定额度
         "Number2": "366000" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "20000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.05", //计算比例2
         "Number": "466000", //固定额度
         "Number2": "666000" //固定额度2
     }, {
         "Min": "20000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "766000", //固定额度
         "Number2": "1166000" //固定额度2
     }
     , {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "1366000", //固定额度
         "Number2": "2366000" //固定额度2
     }
    ]
}, {
    "name": "A19",//内蒙古
    "min": "1000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "10000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "2000" //固定额度2
    }
    , {
        "Min": "10000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.05", //计算比例
        "BL1": "0.06", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "2000" //固定额度2
    }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "500000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0.05", //计算比例2
         "Number": "5500", //固定额度
         "Number2": "7400" //固定额度2
     }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "21500", //固定额度
         "Number2": "27400" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "36500", //固定额度
         "Number2": "47400" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "100000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.015", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "116500", //固定额度
         "Number2": "167400" //固定额度2
     }
     , {
         "Min": "100000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0.01", //计算比例2
         "Number": "191500", //固定额度
         "Number2": "267400" //固定额度2
     }
    ]
}, {
    "name": "A20",//宁夏
    "min": "1000",
    "max": "9999999999999",
    "value": [
    {
        "Min": "0", //标的额区间 区间最小值
        "Max": "10000", //标的额区间 区间最大值
        "IsJs": "0", //是否需要计算
        "BL": "0", //计算比例
        "BL1": "0", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "3000" //固定额度2
    }
    , {
        "Min": "10000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.08", //计算比例
        "BL1": "0.09", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "3000" //固定额度2
    }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.06", //计算比例
         "BL1": "0.08", //计算比例2
         "Number": "8200", //固定额度
         "Number2": "11100" //固定额度2
     }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0.06", //计算比例2
         "Number": "62200", //固定额度
         "Number2": "83100" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "222200", //固定额度
         "Number2": "323100" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "322200", //固定额度
         "Number2": "523100" //固定额度2
     }
     , {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0.01", //计算比例2
         "Number": "722200", //固定额度
         "Number2": "1323100" //固定额度2
     }
    ]
}, {
    "name": "A21",//青海
    "min": "600",
    "max": "9999999999999",
    "value": [
		{
		    "Min": "0", //标的额区间 区间最小值
		    "Max": "100000", //标的额区间 区间最大值
		    "IsJs": "1", //是否需要计算
		    "BL": "0.055", //计算比例
		    "BL1": "0", //计算比例2
		    "Number": "0", //固定额度
		    "Number2": "0" //固定额度2
		}
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "200000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.05", //计算比例
        "BL1": "0", //计算比例2
        "Number": "5500", //固定额度
        "Number2": "0" //固定额度2
    }
     , {
         "Min": "200000", //标的额区间 区间最小值
         "Max": "500000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.045", //计算比例
         "BL1": "0", //计算比例2
         "Number": "10500", //固定额度
         "Number2": "0" //固定额度2
     }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.035", //计算比例
         "BL1": "0", //计算比例2
         "Number": "24000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "2000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0", //计算比例2
         "Number": "41500", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "2000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0", //计算比例2
         "Number": "71500", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0", //计算比例2
         "Number": "131500", //固定额度
         "Number2": "0" //固定额度2
     }
    ]
}, {
    "name": "A22",//山东
    "min": "2500",
    "max": "9999999999999",
    "value": [
{
    "Min": "0", //标的额区间 区间最小值
    "Max": "10000", //标的额区间 区间最大值
    "IsJs": "0", //是否需要计算
    "BL": "0", //计算比例
    "BL1": "0", //计算比例2
    "Number": "2500", //固定额度
    "Number2": "3000" //固定额度2
}
    , {
        "Min": "10000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.06", //计算比例
        "BL1": "0.09", //计算比例2
        "Number": "2500", //固定额度
        "Number2": "3000" //固定额度2
    }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "500000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.05", //计算比例
         "BL1": "0.06", //计算比例2
         "Number": "7900", //固定额度
         "Number2": "11100" //固定额度2
     }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0.05", //计算比例2
         "Number": "27900", //固定额度
         "Number2": "35100" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "47900", //固定额度
         "Number2": "60100" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "0", //是否需要计算
         "BL": "0", //计算比例
         "BL1": "0", //计算比例2
         "Number": "167900", //固定额度
         "Number2": "220100" //固定额度2
     }
    ]
}, {
    "name": "A23",//山西
    "min": "2000",
    "max": "9999999999999",
    "value": [
{
    "Min": "0", //标的额区间 区间最小值
    "Max": "100000", //标的额区间 区间最大值
    "IsJs": "1", //是否需要计算
    "BL": "0.06", //计算比例
    "BL1": "0", //计算比例2
    "Number": "0", //固定额度
    "Number2": "0" //固定额度2
}
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.05", //计算比例
        "BL1": "0", //计算比例2
        "Number": "6000", //固定额度
        "Number2": "0" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0", //计算比例2
         "Number": "26000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0", //计算比例2
         "Number": "46000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0", //计算比例2
         "Number": "166000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.015", //计算比例
         "BL1": "0", //计算比例2
         "Number": "266000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0", //计算比例2
         "Number": "866000", //固定额度
         "Number2": "0" //固定额度2
     }
    ]
}, {
    "name": "A24",//陕西
    "min": "3000",
    "max": "9999999999999",
    "value": [
		{
		    "Min": "0", //标的额区间 区间最小值
		    "Max": "100000", //标的额区间 区间最大值
		    "IsJs": "1", //是否需要计算
		    "BL": "0.08", //计算比例
		    "BL1": "0.1", //计算比例2
		    "Number": "0", //固定额度
		    "Number2": "0" //固定额度2
		}
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.07", //计算比例
        "BL1": "0.09", //计算比例2
        "Number": "8000", //固定额度
        "Number2": "10000" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.06", //计算比例
         "BL1": "0.08", //计算比例2
         "Number": "36000", //固定额度
         "Number2": "46000" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.05", //计算比例
         "BL1": "0.07", //计算比例2
         "Number": "66000", //固定额度
         "Number2": "86000" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0.06", //计算比例2
         "Number": "266000", //固定额度
         "Number2": "366000" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0.05", //计算比例2
         "Number": "466000", //固定额度
         "Number2": "666000" //固定额度2
     }, {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "100000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "1666000", //固定额度
         "Number2": "2666000" //固定额度2
     }, {
         "Min": "100000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "0", //是否需要计算
         "BL": "0", //计算比例
         "BL1": "0", //计算比例2
         "Number": "2666000", //固定额度
         "Number2": "4666000" //固定额度2
     }
    ]
}, {
    "name": "A25",//四川
    "min": "0",
    "max": "9999999999999",
    "value": [
{
    "Min": "0", //标的额区间 区间最小值
    "Max": "100000", //标的额区间 区间最大值
    "IsJs": "1", //是否需要计算
    "BL": "0.06", //计算比例
    "BL1": "0", //计算比例2
    "Number": "0", //固定额度
    "Number2": "0" //固定额度2
}
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.055", //计算比例
        "BL1": "0", //计算比例2
        "Number": "6000", //固定额度
        "Number2": "0" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.05", //计算比例
         "BL1": "0", //计算比例2
         "Number": "28000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.04", //计算比例
         "BL1": "0", //计算比例2
         "Number": "53000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.03", //计算比例
         "BL1": "0", //计算比例2
         "Number": "213000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0", //计算比例2
         "Number": "363000", //固定额度
         "Number2": "0" //固定额度2
     }
    ]
}, {
    "name": "A26",//天津
    "min": "3000",
    "max": "9999999999999",
    "value": [
{
    "Min": "0", //标的额区间 区间最小值
    "Max": "100000", //标的额区间 区间最大值
    "IsJs": "1", //是否需要计算
    "BL": "0.08", //计算比例
    "BL1": "0", //计算比例2
    "Number": "0", //固定额度
    "Number2": "0" //固定额度2
}
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "1000000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.06", //计算比例
        "BL1": "0", //计算比例2
        "Number": "8000", //固定额度
        "Number2": "0" //固定额度2
    }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.04", //计算比例
         "BL1": "0", //计算比例2
         "Number": "62000", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.02", //计算比例
         "BL1": "0", //计算比例2
         "Number": "422000", //固定额度
         "Number2": "0" //固定额度2
     }
    ]
}, {
    "name": "A27",//西安
    "min": "5000",
    "max": "9999999999999",
    "value": [
{
    "Min": "0", //标的额区间 区间最小值
    "Max": "100000", //标的额区间 区间最大值
    "IsJs": "1", //是否需要计算
    "BL": "0.08", //计算比例
    "BL1": "0.1", //计算比例2
    "Number": "0", //固定额度
    "Number2": "0" //固定额度2
}
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.07", //计算比例
        "BL1": "0.09", //计算比例2
        "Number": "8000", //固定额度
        "Number2": "10000" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.06", //计算比例
         "BL1": "0.08", //计算比例2
         "Number": "36000", //固定额度
         "Number2": "46000" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.05", //计算比例
         "BL1": "0.07", //计算比例2
         "Number": "66000", //固定额度
         "Number2": "86000" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.04", //计算比例
         "BL1": "0.06", //计算比例2
         "Number": "266000", //固定额度
         "Number2": "366000" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.03", //计算比例
         "BL1": "0.05", //计算比例2
         "Number": "466000", //固定额度
         "Number2": "666000" //固定额度2
     }, {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "100000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.02", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "1666000", //固定额度
         "Number2": "2666000" //固定额度2
     }, {
         "Min": "100000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.01", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "2666000", //固定额度
         "Number2": "4666000" //固定额度2
     }
    ]
}, {
    "name": "A28",//西藏
    "min": "1000",
    "max": "9999999999999",
    "value": [
{
    "Min": "0", //标的额区间 区间最小值
    "Max": "100000", //标的额区间 区间最大值
    "IsJs": "1", //是否需要计算
    "BL": "0.04", //计算比例
    "BL1": "0.06", //计算比例2
    "Number": "0", //固定额度
    "Number2": "0" //固定额度2
}
    , {
        "Min": "100000", //标的额区间 区间最小值
        "Max": "500000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.035", //计算比例
        "BL1": "0.05", //计算比例2
        "Number": "4000", //固定额度
        "Number2": "6000" //固定额度2
    }
     , {
         "Min": "500000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.03", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "18000", //固定额度
         "Number2": "26000" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.02", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "33000", //固定额度
         "Number2": "46000" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.015", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "213000", //固定额度
         "Number2": "316000" //固定额度2
     }, {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "100000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.01", //计算比例
         "BL1": "0.015", //计算比例2
         "Number": "813000", //固定额度
         "Number2": "1116000" //固定额度2
     }, {
         "Min": "100000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0.005", //计算比例2
         "Number": "1313000", //固定额度
         "Number2": "1866000" //固定额度2
     }
    ]
}, {
    "name": "A29",//新疆
    "min": "1000",
    "max": "9999999999999",
    "value": [
{
    "Min": "0", //标的额区间 区间最小值
    "Max": "10000", //标的额区间 区间最大值
    "IsJs": "0", //是否需要计算
    "BL": "0", //计算比例
    "BL1": "0", //计算比例2
    "Number": "1000", //固定额度
    "Number2": "3000" //固定额度2
}
    , {
        "Min": "10000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.08", //计算比例
        "BL1": "0.09", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "3000" //固定额度2
    }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.06", //计算比例
         "BL1": "0.08", //计算比例2
         "Number": "8200", //固定额度
         "Number2": "11100" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.04", //计算比例
         "BL1": "0.06", //计算比例2
         "Number": "62200", //固定额度
         "Number2": "83100" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.02", //计算比例
         "BL1": "0.04", //计算比例2
         "Number": "222200", //固定额度
         "Number2": "323100" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.01", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "322200", //固定额度
         "Number2": "523100" //固定额度2
     }, {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0.01", //计算比例2
         "Number": "722200", //固定额度
         "Number2": "1323100" //固定额度2
     }
    ]
}, {
    "name": "A30",//银川
    "min": "1000",
    "max": "9999999999999",
    "value": [
{
    "Min": "0", //标的额区间 区间最小值
    "Max": "10000", //标的额区间 区间最大值
    "IsJs": "0", //是否需要计算
    "BL": "0", //计算比例
    "BL1": "0", //计算比例2
    "Number": "1000", //固定额度
    "Number2": "3000" //固定额度2
}
    , {
        "Min": "10000", //标的额区间 区间最小值
        "Max": "100000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.08", //计算比例
        "BL1": "0.09", //计算比例2
        "Number": "1000", //固定额度
        "Number2": "3000" //固定额度2
    }
     , {
         "Min": "100000", //标的额区间 区间最小值
         "Max": "1000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.06", //计算比例
         "BL1": "0.08", //计算比例2
         "Number": "8200", //固定额度
         "Number2": "11100" //固定额度2
     }, {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.04", //计算比例
         "BL1": "0.06", //计算比例2
         "Number": "62200", //固定额度
         "Number2": "83100" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.02", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "222200", //固定额度
         "Number2": "323100" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.01", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "322200", //固定额度
         "Number2": "523100" //固定额度2
     }, {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0.1", //计算比例2
         "Number": "722200", //固定额度
         "Number2": "1323100" //固定额度2
     }
    ]
}, {
    "name": "A31",//云南
    "min": "5000",
    "max": "9999999999999",
    "value": [
        {
            "Min": "0", //标的额区间 区间最小值
            "Max": "100000", //标的额区间 区间最大值
            "IsJs": "1", //是否需要计算
            "BL": "0.05", //计算比例
            "BL1": "0", //计算比例2
            "Number": "0", //固定额度
            "Number2": "0" //固定额度2
        },
		{
		    "Min": "100000", //标的额区间 区间最小值
		    "Max": "500000", //标的额区间 区间最大值
		    "IsJs": "1", //是否需要计算
		    "BL": "0.042", //计算比例
		    "BL1": "0", //计算比例2
		    "Number": "5000", //固定额度
		    "Number2": "0" //固定额度2
		}
    , {
        "Min": "500000", //标的额区间 区间最小值
        "Max": "1000000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.04", //计算比例
        "BL1": "0", //计算比例2
        "Number": "21800", //固定额度
        "Number2": "0" //固定额度2
    }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.03", //计算比例
         "BL1": "0", //计算比例2
         "Number": "41800", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.02", //计算比例
         "BL1": "0", //计算比例2
         "Number": "161800", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "20000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.012", //计算比例
         "BL1": "0", //计算比例2
         "Number": "261800", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "20000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.01", //计算比例
         "BL1": "0", //计算比例2
         "Number": "381800", //固定额度
         "Number2": "0" //固定额度2
     }, {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0", //计算比例2
         "Number": "681800", //固定额度
         "Number2": "0" //固定额度2
     }
    ]
}, {
    "name": "A32",//重庆
    "min": "5000",
    "max": "9999999999999",
    "value": [
        {
            "Min": "0", //标的额区间 区间最小值
            "Max": "100000", //标的额区间 区间最大值
            "IsJs": "1", //是否需要计算
            "BL": "0.05", //计算比例
            "BL1": "0.06", //计算比例2
            "Number": "0", //固定额度
            "Number2": "0" //固定额度2
        },
		{
		    "Min": "100000", //标的额区间 区间最小值
		    "Max": "1000000", //标的额区间 区间最大值
		    "IsJs": "1", //是否需要计算
		    "BL": "0.04", //计算比例
		    "BL1": "0.05", //计算比例2
		    "Number": "5000", //固定额度
		    "Number2": "6000" //固定额度2
		}
    , {
        "Min": "1000000", //标的额区间 区间最小值
        "Max": "5000000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.03", //计算比例
        "BL1": "0.04", //计算比例2
        "Number": "41000", //固定额度
        "Number2": "51000" //固定额度2
    }
     , {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.02", //计算比例
         "BL1": "0.03", //计算比例2
         "Number": "161000", //固定额度
         "Number2": "211000" //固定额度2
     }, {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.01", //计算比例
         "BL1": "0.02", //计算比例2
         "Number": "261000", //固定额度
         "Number2": "361000" //固定额度2
     }, {
         "Min": "50000000", //标的额区间 区间最小值
         "Max": "9999999999999", //标的额区间 区间最大值
         "IsJs": "1", //是否需要计算
         "BL": "0.005", //计算比例
         "BL1": "0.01", //计算比例2
         "Number": "661000", //固定额度
         "Number2": "1161000" //固定额度2
     }
    ]
}, {
    "name": "A33",//海南
    "min": "2000",
    "max": "9999999999999",
    "value": [
        {
            "Min": "0", //标的额区间 区间最小值
            "Max": "100000", //标的额区间 区间最大值
            "IsJs": "1", //是否需要计算
            "BL": "0.06", //计算比例
            "BL1": "0", //计算比例2
            "Number": "0", //固定额度
            "Number2": "0" //固定额度2
        },
		{
		    "Min": "100000", //标的额区间 区间最小值
		    "Max": "500000", //标的额区间 区间最大值
		    "IsJs": "1", //是否需要计算
		    "BL": "0.05", //计算比例
		    "BL1": "0", //计算比例2
		    "Number": "6000", //固定额度
		    "Number2": "0" //固定额度2
		}
    , {
        "Min": "500000", //标的额区间 区间最小值
        "Max": "1000000", //标的额区间 区间最大值
        "IsJs": "1", //是否需要计算
        "BL": "0.04", //计算比例
        "BL1": "0", //计算比例2
        "Number": "26000", //固定额度
        "Number2": "0" //固定额度2
    }
     , {
         "Min": "1000000", //标的额区间 区间最小值
         "Max": "5000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.03", //计算比例
         "BL1": "0", //计算比例2
         "Number": "46000", //固定额度
         "Number2": "0" //固定额度2
     }
     , {
         "Min": "5000000", //标的额区间 区间最小值
         "Max": "10000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.02", //计算比例
         "BL1": "0", //计算比例2
         "Number": "166000", //固定额度
         "Number2": "0" //固定额度2
     }
     , {
         "Min": "10000000", //标的额区间 区间最小值
         "Max": "50000000", //标的额区间 区间最大值
         "IsJs": "1", //是否需要W计算
         "BL": "0.01", //计算比例
         "BL1": "0", //计算比例2
         "Number": "266000", //固定额度
         "Number2": "0" //固定额度2
     }
      , {
          "Min": "50000000", //标的额区间 区间最小值
          "Max": "9999999999999", //标的额区间 区间最大值
          "IsJs": "1", //是否需要W计算
          "BL": "0.005", //计算比例
          "BL1": "0", //计算比例2
          "Number": "666000", //固定额度
          "Number2": "0" //固定额度2
      }
    ]
}
];
//"A2": [
//      {
//          "Min": "0",//标的额区间 区间最小值
//          "Max": "200000",//标的额区间 区间最大值
//          "BL": "0",//计算比例
//          "IsJsu": "0",//是否需要计算
//          "Number": "50～300"//固定额度
//      },
//       {
//           "Min": "200000",//标的额区间 区间最小值
//           "Max": "0",//标的额区间 区间最大值
//           "BL": "0.005",//计算比例
//           "Number": "-950",//固定额度
//           "Number2": "-700"//固定额度
//       }
//]
$(document).ready(function () {
    var values = "";
    $.each(ajType, function (idx, item) {
        values += " <option value=\"" + item.value + "\">" + item.name + "</option>";
    });
    $("#t1").append(values);
});

function setXs(city) {
    $.each(xs, function (idx, item) {
        if (item.name === city) {
            $.each(item.value, function (idx2, item2) {
                $("#table").show();
                $("#Price").parent().addClass("l_des");
                $("#Price").html("侦查阶段：<span style='color:red'>" + item2.T1 + "</span><br />审查起诉阶段：<span style='color:red'>" + item2.T2 + "</span><br />审判阶段：<span style='color:red'>" + item2.T3 + "</span>");
            });
        }
    });
    $.each(ajType, function (idx, item) {
        if (item.value === city) {
            $("#bzDiv").html("依据<a  target='_balnk'  href=\"elvshitools://html/" + item.Url + "\">《" + item.name + "律师收费标准》</a>文件计算，结果仅供参考");

        }
    });
}

function setJS() {
    if (PostCheck()) {
        var returnValue = 0.00;
        var returnValue2 = 0.00;
        var city = $("#t1").val(); //所在地区
        var type = $("#t2").val(); //案件类型
        var priceValue = $("#prices").val(); //标的金额
        if (type === "1") {
            setXs(city);
        } else {
            $.each(endPrices, function (idx, item) {
                $("#Price").parent().removeClass("l_des");
                if (item.name === city) {
                    var cityMin = parseFloat(item.min); //最小区间
                    var cityMax = parseFloat(item.max); //最大区间


                    $.each(item.value, function (idx2, item2) {
                        var min = parseFloat(item2.Min); //最小区间
                        var max = parseFloat(item2.Max); //最大区间
                        var bL = parseFloat(item2.BL); //计算比例
                        var bL1 = parseFloat(item2.BL1); //计算比例
                        var isJs = item2.IsJs; //是否需要计算
                        var number = parseFloat(item2.Number); //固定额度
                        var number2 = parseFloat(item2.Number2); //固定额度2(适用于区间费用)
                        var price = parseFloat(priceValue);
                        //判断是否在区间内
                        if ((min < price && price <= max) || (min < price && max === 0)) {
                            if (isJs === "0") {
                                returnValue = number;
                                if (number2 !== 0) {
                                    returnValue2 = number2;
                                }
                            } else {
                                returnValue = (price - min) * bL + number;
                                returnValue2 = (price - min) * bL1 + number2;
                            }
                            if (returnValue < cityMin && returnValue2 < cityMin) {
                                returnValue = cityMin;
                                returnValue2 = 0;
                            } else if (returnValue < cityMin && returnValue > 0) {
                                returnValue = cityMin;
                            } else if (returnValue2 < cityMin && returnValue2 > 0) {
                                returnValue2 = cityMin;
                            }


                        }
                    });
                }
            });
            $("#table").show();

            if (returnValue2 === 0.00) {
                $("#Price").html("律师费：<span style='color:red'>" + returnValue.toFixed(2) + "</span> 元");
            } else {
                $("#Price").html("律师费：<span style='color:red'>" + returnValue.toFixed(2) + "</span> 元至 <span  style='color:red'>" + returnValue2.toFixed(2) + "</span> 元");
            }
            $.each(ajType, function (idx, item) {
                if (item.value === city) {
                    $("#bzDiv").html("注：依据<a target='_balnk' href=\"elvshitools://html/" + item.Url + "\">《" + item.name + "律师收费标准》</a>文件计算，结果仅供参考");
                }
            });

        }
    }
}